app/controllers/users_controller.rb

  	def update
	  current_user.update(params[:id])
---
UPDATE "users" SET "website" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["website", "Rajesj@gmail.com"], ["updated_at", "2022-08-22 15:51:14.747987"], ["id", 1]]

	def update
    @user = User.find(params[:id])

	    respond_to do |format|
		    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "website" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["website", "Rajesj@gmail.com"], ["updated_at", "2022-08-22 15:51:14.747987"], ["id", 1]]